target/classes/messages.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org">
   <soap:Header>
      <tem:MySoapHeader>
         <tem:UserName>username</tem:UserName>
         <tem:PassWord>userpass</tem:PassWord>
      </tem:MySoapHeader>
   </soap:Header>
   <soap:Body>
      <tem:sendMsg>
         <tem:usernumber>phones</tem:usernumber>
         <tem:msg>messages</tem:msg>
      </tem:sendMsg>
   </soap:Body>
</soap:Envelope>
